app/views/operation_categories/_form.html.erb

SELECT  "operation_categories".* FROM "operation_categories" ORDER BY "operation_categories"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    <%= form.label :operation_category_id %>
    <%= form.select :operation_category_id,
        OperationCategory.all.map { |_m| [_m.name, _m.id] }, id: :operation_category_operation_category_id, include_blank: true %>