app/controllers/accounts_controller.rb

INSERT INTO "accounts" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Test account"], ["created_at", "2017-07-09 18:47:48.286225"], ["updated_at", "2017-07-09 18:47:48.286225"]]
---
  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save