app/controllers/operation_categories_controller.rb

  def index
    @operation_categories = OperationCategory.all
---
SELECT "operation_categories".* FROM "operation_categories"

  def create
    @operation_category = OperationCategory.new(operation_category_params)

    respond_to do |format|
      if @operation_category.save
---
INSERT INTO "operation_categories" ("name", "operation_category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "New category"], ["operation_category_id", 0], ["created_at", "2017-07-09 19:09:34.125684"], ["updated_at", "2017-07-09 19:09:34.125684"]]

  def update
    respond_to do |format|
      if @operation_category.update(operation_category_params)
---
UPDATE "operation_categories" SET "operation_category_id" = ?, "updated_at" = ? WHERE "operation_categories"."id" = ?  [["operation_category_id", 2], ["updated_at", "2017-07-09 19:12:22.800590"], ["id", 2]]

    def set_operation_category
      @operation_category = OperationCategory.find(params[:id])
---
SELECT  "operation_categories".* FROM "operation_categories" WHERE "operation_categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]