app/controllers/operations_controller.rb

SELECT "operations".* FROM "operations"
---
  def index
    @operations = Operation.all

INSERT INTO "operations" ("account_id", "operation_category_id", "name", "original_name", "amount", "operation_date", "value_date", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @operation = Operation.new(operation_params)

    respond_to do |format|
      if @operation.save

UPDATE "operations" SET "amount" = ?, "updated_at" = ? WHERE "operations"."id" = ?  [["amount", 32.47], ["updated_at", "2017-07-09 19:20:55.965816"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @operation.update(operation_params)

SELECT  "operations".* FROM "operations" WHERE "operations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_operation
      @operation = Operation.find(params[:id])