app/views/operations/_form.html.erb

    <%= form.label :account_id %>
    <%= form.select :account_id,
        Account.all.map { |_m| [_m.name, _m.id] }, id: :operation_account_id %>
---
SELECT "accounts".* FROM "accounts"

    <%= form.label :operation_category_id %>
    <%= form.select :operation_category_id,
        OperationCategory.all.map { |_m| [_m.name, _m.id] }, id: :operation_operation_category_id %>
---
SELECT "operation_categories".* FROM "operation_categories"